{"data":{"allContentfulProject":{"edges":[{"node":{"id":"46aafd1c-f55f-5bc1-802d-c8aa7b3c1655","title":"Personal Website","brief":"This website is made using React, JavaScript, Gatsby, HTML5/Sass, Contentful, and Netlify","date":"November 2019","link":"https://davidlarkin.dev/","description":{"description":"My portfolio is a way to display the work that I've completed. Needing an online presence to portray some of my projects, this site came to life. I designed and developed the website using React, Gatsby, Contentful CMS and used Netlify to host the website. I used Sass for more manageable files and code structure. I also implemented some small CSS animations such as the typing animation in the banner. I used GraphQL to pull the data from Contentful to display it on the site. Each project page is also dynamic and adding a new project on Contentful will create a new page to the site."},"image":{"fluid":{"src":"//images.ctfassets.net/muk1dsfdlq3c/4lwsWvL9powlt5yC0UtXY7/0cc5c3fc8034dc401aac4a4dc0742133/personalSiteBanner.png?w=800&q=50"},"description":"personal-website-banner-image"}}},{"node":{"id":"43fc1adb-4e4e-5b6b-a464-39a01b11a345","title":"Respect For Refugees","brief":"Charity website made with React/Gatsby, integrating PayPal.","date":"April 2020","link":null,"description":{"description":"A charity website made using React, Gatsby, HTML5/CSS(Sass), JavaScript, GraphQL and hosted by Netlify. Content is pulled from Contentful, and the homepage sections can be moved around by the user at will. Developed with a mobile-first mentality and translated from Figma design to production code. PayPal has been integrated to allow users to donate if they wish. "},"image":{"fluid":{"src":"//images.ctfassets.net/muk1dsfdlq3c/PvFZ9cwkwiA61i0yHEJku/60df968452feb751bb98cb387de44617/04ef541331e5ebe15e1b0b55a32fe33a.png?w=800&q=50"},"description":"Respect for Refugees landing page and hero section"}}},{"node":{"id":"9b791657-af98-57d3-9b24-ec0b3ae00618","title":"Get The Weather","brief":"A small weather website that fetches the weather via the OpenWeather API","date":"January 2020","link":"https://gettheweather.netlify.com/","description":{"description":"A small website made with React, Gatsby, JavaScript, HTML/SASS and the OpenWeather API to fetch weather data (using asychronous calls). Designed wireframes in Figma and translated it to code for prototyping. Took a mobile-first approach to make sure it would be responsive and look appealing on a smaller viewport. Implemented geolocation services so that the user can fetch weather data from their current location. Error handling implemented for fetch requests and if user input is invalid. They can also search for a city and country to get the weather all around the world. "},"image":{"fluid":{"src":"//images.ctfassets.net/muk1dsfdlq3c/1qidJe2qJWX3SERo0cvXqu/9a54a181a24006d6290395f0ad6b9f25/Screen3.png?w=800&q=50"},"description":"Display for today's weather picture"}}},{"node":{"id":"731919c2-286d-51de-85dd-d9e9936a11de","title":"Adrift","brief":"Adrift is an RPG game made in Unity using C#","date":"May 2019","link":"https://davidclarkin.itch.io/adrift","description":{"description":"Adrift is a 2D action role-playing game made in the Unity Game Engine, written in C#. The game features procedural level generation using an algorithm vaguely inspired by the Random Walk algorithm. I implemented an inventory and item system through use of object oriented designs (Inheritence). The enemy AI uses A* pathfinding, catering to the procedural level generation algorithm. A lot of the features also use a component based design for less code duplication and more reusability. Finally, delegation via the Event system in C# is used to decouple as much code as possible. Adrift has been released on Itch.io as a free to play game."},"image":{"fluid":{"src":"//images.ctfassets.net/muk1dsfdlq3c/1wnugNVK0KCzQbwWuVehr1/37b583ddfdc1a5d75fb9794bf1f2d18c/MainMenuPostChangeCentered__2_.png?w=800&q=50"},"description":"Adrift-logo-image"}}},{"node":{"id":"d7c2f67c-f539-57d4-ac66-03b5b947687b","title":"Brophy Brothers","brief":"The Brophy Brothers website is a grocery suppliers website made using React, Gatsby, JavaScript/HTML5, Netlify, and Contentful","date":"August 2019","link":"https://brophybrothers.netlify.com/","description":{"description":"Brophy Brothers is a wholesale produce supplier website built by dazzle works. I was hired as a freelance web developer to implement the search and filtering functionality and the products page. The products page allows the user to filter goods in the store by categories such as Fruit, Vegetables, Dairy, Frozen or All. It also allows the user to further filter the products by subcategories which are more specific to each product type. I also got to test out applying the CSS stylings to the page to make it more responsive and user friendly across many device viewport sizes. "},"image":{"fluid":{"src":"//images.ctfassets.net/muk1dsfdlq3c/1RkEw1Ucg2pfIslB7aKeMQ/7af47e1cb14938f94c3edbd1cd280c1f/brophyLogoBanner.png?w=800&q=50"},"description":"brophy-brother-logo"}}}]}}}