{"data":{"allContentfulProject":{"edges":[{"node":{"id":"731919c2-286d-51de-85dd-d9e9936a11de","title":"Adrift","brief":"Adrift is an RPG game made in Unity using C#","date":"May 2019","link":"https://davidclarkin.itch.io/adrift","description":{"description":"Adrift is a 2D action role-playing game that tests players mettle. It encourages players to learn from past mistakes through difficult bosses and their unforgiving mechanics. Dying means losing progress in the current dungeon and having to try again. Dungeons are generated procedurally so that every play session is unique. Combat is mainly melee based but some weapons that are obtained through boss loot can come equipped with perks that have ranged abilities. Upgradable stats make for in-depth character progression along with the looting system from overcoming a boss encounter. Adrift has been released on Itch.io as a free to play game."},"image":{"fluid":{"src":"//images.ctfassets.net/muk1dsfdlq3c/1wnugNVK0KCzQbwWuVehr1/37b583ddfdc1a5d75fb9794bf1f2d18c/MainMenuPostChangeCentered__2_.png?w=800&q=50"},"description":"Adrift-logo-image"}}},{"node":{"id":"d7c2f67c-f539-57d4-ac66-03b5b947687b","title":"Brophy Brothers","brief":"The Brophy Brothers website is a grocery suppliers website made using React, Gatsby, JavaScript/HTML5, Netlify, and Contentful","date":"August 2019","link":"https://brophybrothers.netlify.com/","description":{"description":"Brophy Brothers is a wholesale produce supplier website built by dazzle works. I was hired as a freelance web developer to implement the search and filtering functionality and the products page. The products page allows the user to filter goods in the store by categories such as Fruit, Vegetables, Dairy, Frozen or All. It also allows the user to further filter the products by subcategories which are more specific to each product type. I also got to test out applying the CSS stylings to the page to make it more responsive and user friendly across many device viewport sizes. "},"image":{"fluid":{"src":"//images.ctfassets.net/muk1dsfdlq3c/1RkEw1Ucg2pfIslB7aKeMQ/f02626d9ef998da59cc1e504972a73ac/brophyLogoBanner.png?w=800&q=50"},"description":"brophy-brother-logo"}}},{"node":{"id":"46aafd1c-f55f-5bc1-802d-c8aa7b3c1655","title":"Personal Website","brief":"This website is made using React, JavaScript, Gatsby, HTML5/Sass, Contentful, and Netlify","date":"November 2019","link":"https://davidlarkin.dev/","description":{"description":"My personal portfolio is a way to display the work that I've completed. Developing this website was part of a learning process to engage with front-end development. Needing an online presence to portray some of my projects, this site came to life. I both designed and coded the whole project which gave me a new love for web development that I didn't have previously. Similar to game development, I got to test and fiddle around with big features like UI/UX to smaller features such as small animations sprinkled around the website.  "},"image":{"fluid":{"src":"//images.ctfassets.net/muk1dsfdlq3c/4lwsWvL9powlt5yC0UtXY7/0cc5c3fc8034dc401aac4a4dc0742133/personalSiteBanner.png?w=800&q=50"},"description":"personal-website-banner-image"}}}]}}}